cask_args appdir: "/Applications"

tap "homebrew/bundle"

# Modern cat replacement with syntax highlighting, Git integration, and paging
brew "bat"
# System resource monitor with real-time CPU, memory, disk, network, and process stats
brew "btop"
# Terminal-based Matrix digital rain animation
brew "cmatrix"
# Modern ls replacement with Git integration, icons, and tree view
brew "eza"
# Fuzzy finder for command line with advanced search and completion
brew "fzf"
# Syntax-highlighting pager for Git, diff, and grep with delta improvements
brew "git-delta"
# Beautiful terminal UI toolkit for shell scripts
brew "gum"
# Docker management TUI with container and image management
brew "lazydocker"
# Git TUI with staging, committing, and diff viewing
brew "lazygit"
# Media player supporting various formats with hardware acceleration
brew "mpv"
# System information tool with customizable display options
brew "neofetch"
# Modern Vim fork with Lua scripting and better defaults
brew "neovim"
# JavaScript runtime and package manager
brew "node"
# Fast, disk space efficient Node.js package manager
brew "pnpm"
# Systems programming language with modern features
brew "rust"
# Fast, minimal, and customizable shell prompt
brew "starship"
# Symlink manager for dotfiles and configuration
brew "stow"
# Command correction tool that suggests fixes for typos
brew "thefuck"
# Terminal multiplexer for persistent sessions
brew "tmux"
# Tmux plugin manager for easy plugin installation
brew "tpm"
# Smart directory jumper with learning capabilities
brew "zoxide"
# Fish-like autosuggestions for Zsh command history
brew "zsh-autosuggestions"
# Syntax highlighting for Zsh commands
brew "zsh-syntax-highlighting"

# Windows Alt-Tab style application switcher for macOS
cask "alt-tab"
# Container platform for building and running applications
cask "docker"
# Dock management tool for macOS
cask "dockey"
# Privacy-focused web browser
cask "firefox"
# Programming font with extensive icon support
cask "font-jetbrains-mono-nerd-font"
# Modern monospace font with icon support
cask "font-geist-mono-nerd-font"
# Clean, readable monospace font
cask "font-maple-mono"
# GPU-accelerated terminal with modern features
cask "ghostty"
# API development and testing platform
cask "insomnia"
# Tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Markdown-based note-taking and knowledge management
cask "obsidian"
# Spotlight-like productivity tool with extensions
cask "raycast"
